tutorials/16.1.1.1D_2phase_2componentGas_YCO2i_0_quaternaryRhoNsCompositionalDarcyFoam_mutual_slbty_U_0.005_den_mu_Ns_2/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

cp 0.orig 0 -R

runApplication blockMesh

runApplication $(getApplication)

#------------------------------------------------------------------------------